<template>
  <div class="news-items-container">
    <div class="news-items-content">
        <div class="news-items" v-for="item, idx in news" :key="idx">
            <img :src="require('@/assets/News/Content/' + item.img)" alt="">
            <div class="news-date">
                <p>{{item.date}}</p>
            </div>
            <h3>{{item.title}}</h3>
            <span>{{item.descript}}</span>
        </div>
    </div>
  </div>
</template>
<script>
export default {
  name: "news-items",
  data() {
    return {
      news: [
        {
          id: 1,
          img: "img1.png",
          date: "17.05.2021",
          title:
            "Страховая организация «BIMA» отметила заслуги сотрудников банка «Арванд»",
          descript:
            "По завершении церемонии руководство Страховой организации «BIMA» выразила искреннюю благодарность всему коллективу...",
        },
        {
          id: 2,
          img: "img2.png",
          date: "02.05.2021",
          title:
            "Первая международная олимпиадапо ментальной арифметике «ШОСkids»",
          descript:
            "В Душанбе в Президентском лицее для одаренных детей состоялась Первая Международная Олимпиада по ментальной...",
        },
        {
          id: 3,
          img: "img3.png",
          date: "14.04.2021",
          title: "Самые яркие моменты к 7-летиюстраховой организации «BIMA»",
          descript:
            "Свой день рождения «BIMA» традиционно отмечает 14 апреля – дня получения первой лицензии на право ведения страховой...",
        },
        {
          id: 4,
          img: "img4.png",
          date: "21.03.2021",
          title: "С Праздником Навруз!",
          descript:
            "В преддверии прекрасного праздника, мы от всего сердца хотим поздравить Вас с наступающим днём весеннего равноденствия и обновления природы – Навруз!",
        },
        {
          id: 5,
          img: "img5.png",
          date: "30.01.2021",
          title:
            "Презентация новых страховых опций«Мобихранитель» и «Мобихранитель + »",
          descript:
            "В торговом центре Душанбе Мол (Ашан) состоялась презентация новых страховых опций «МобиХранитель» и «МобиХранитель...",
        },
        {
          id: 6,
          img: "img6.png",
          date: "09.01.2021",
          title:
            "Tcell и «BIMA» представляют опции для страхования мобильной техники",
          descript:
            "Ведущий инновационный оператор страны – компания Tcell и страховая компания BIMA Insurance представляют страховые опции...",
        },
      ],
    };
  },
};
</script>
